Revit 2027 API
ConnectorElement.FlipDirection Method
 Reverses the direction of the connector element.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void FlipDirection()
Public Sub FlipDirection
public:
void FlipDirection()
member FlipDirection : unit -> unit
See Also
Reference
ConnectorElement Class
Autodesk.Revit.DB Namespace